## Staging: database-tools
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| update | `aws_iam_policy.blazer_exection_role_parameter_policy` |
|        | `aws_iam_policy.blazer_task_role_policy`               |
|        | `aws_ssm_parameter.sqlalchemy_database_reader_uri`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.blazer_exection_role_parameter_policy_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "blazer_exection_role_parameter_policy_actions"  {
      ~ id      = "1850030226" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/notify_o11y_google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/notify_o11y_google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.blazer_task_role_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "blazer_task_role_actions"  {
      ~ id      = "1850030226" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/notify_o11y_google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/notify_o11y_google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_iam_policy.blazer_exection_role_parameter_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_exection_role_parameter_policy" {
        id        = "arn:aws:iam::239043911459:policy/blazer_exection_role_parameter_policy"
        name      = "blazer_exection_role_parameter_policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/notify_o11y_google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/notify_o11y_google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_task_role_policy" {
        id        = "arn:aws:iam::239043911459:policy/blazer_task_role_policy"
        name      = "blazer_task_role_policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/notify_o11y_google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/notify_o11y_google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.sqlalchemy_database_reader_uri will be updated in-place
  ~ resource "aws_ssm_parameter" "sqlalchemy_database_reader_uri" {
        id              = "sqlalchemy_database_reader_uri"
      + insecure_value  = (known after apply)
        name            = "sqlalchemy_database_reader_uri"
        tags            = {
            "CostCenter" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 4 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_db_instance.database-tools,
  on rds.tf line 18, in resource "aws_db_instance" "database-tools":
  18:   name                = "database_tools"

Use db_name instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.database-tools"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.database-tools-rds-subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_exection_role_parameter_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_task_role_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.db_tools_environment_variables"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.sqlalchemy_database_reader_uri"]

32 tests, 17 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
